read_verilog -sv -formal -overwrite {workspace}/adder.v
design -reset-vlog; proc;
write_json {workspace}/netlist/adder.json