read_verilog -sv -formal -overwrite {workspace}/flopr.v
design -reset-vlog; proc;
write_json {workspace}/netlist/flopr.json