read_verilog -sv -formal -overwrite {workspace}/mux.v
design -reset-vlog; proc;
write_json {workspace}/netlist/mux.json